// 0 = lối đi
// 1 = slot đậu xe
// 2,3,8 = tường / cột

export const PARKING_LAYOUT = [
    [2,8,8,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2],
    [2,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2],
    [2,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2],
    [2,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2],
    [2,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2],
    [2,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2],
    [2,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2],
    [2,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2],
    [2,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2],
    [2,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2],
    [2,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2],
    [2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2],
];
export type SensorIndex = {
    sensorId: number;
    slotId: number;
    r: number;
    c: number;
};

export type SlotIndex = {
    id: number;
    r: number;
    c: number;
};



export const SLOT_INDEX: SlotIndex[] = (() => {
    let id = 1;
    const slots: SlotIndex[] = [];

    PARKING_LAYOUT.forEach((row, r) => {
        row.forEach((cell, c) => {
            if (cell === 1) {
                slots.push({
                    id: id++,
                    r,
                    c,
                });
            }
        });
    });

    return slots;
})();
export const SENSOR_INDEX: SensorIndex[] = (() => {
    let sensorId = 1;
    const sensors: SensorIndex[] = [];

    SLOT_INDEX.forEach(slot => {
        const sensorRow = slot.r - 1;
        const sensorCol = slot.c;

        // Chỉ tạo sensor nếu vị trí sensor là lối đi (0)
        if (PARKING_LAYOUT[sensorRow]?.[sensorCol] === 0) {
            sensors.push({
                sensorId: sensorId++,
                slotId: slot.id,
                r: sensorRow,
                c: sensorCol,
            });
        }
    });

    return sensors;
})();
